src/Gemline/NotificationService/getOrderStatusDetails.http

POST https://wsp.gemline.com/GemlineWebService/OrderStatus/v1/GemlineOrderStatusService.svc
Content-Type: text/xml;charset=UTF-8
SOAPAction: "getOrderStatusDetails"

// seems like if we don't express the referenceNumber we get
// a list of all orders we have w/ Gemline?


<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns="http://www.promostandards.org/WSDL/OrderStatusService/1.0.0/">
    <soapenv:Header/>
    <soapenv:Body>
        <ns:GetOrderStatusDetailsRequest>
            <ns:wsVersion>1.0.0</ns:wsVersion>
            <ns:id>3004775</ns:id>
            <ns:password>fE1oK6vB4eX8oC9i</ns:password>
            <ns:queryType>?</ns:queryType>
            <!--Optional:-->
            <ns:referenceNumber>?</ns:referenceNumber>
            <ns:statusTimeStamp>?</ns:statusTimeStamp>
        </ns:GetOrderStatusDetailsRequest>
    </soapenv:Body>
</soapenv:Envelope>